c3.generate({
    bindto: '#chart1_1',
    data: {
        // iris data from R
        columns: [
            ['งบประมาณที่ตั้งไว้', 30],
            ['ผลการเบิกจ่ายงบประมาณจริง', 120],
            ['ยังไม่ได้รายงาน', 100],
        ],
        type : 'pie',
        onclick: function (d, i) { //console.log("onclick", d, i)
        //alert('Hello, World!')
        $('html,body').animate({
        scrollTop: $(".second").offset().top},
        'slow')

        ; }
    }
    
});
c3.generate({
    bindto: '#chart1_2',
    data: {
        // iris data from R
        columns: [
            ['งบประมาณที่ตั้งไว้', 100],
            ['ผลการเบิกจ่ายงบประมาณจริง', 100],
            ['ยังไม่ได้รายงาน', 80],
        ],
        type : 'pie',
        onclick: function (d, i) { console.log("onclick", d, i); }
    }
});
c3.generate({
    bindto: '#chart1_3',
    data: {
        // iris data from R
        columns: [
            ['งบประมาณที่ตั้งไว้', 70],
            ['ผลการเบิกจ่ายงบประมาณจริง', 100],
            ['ยังไม่ได้รายงาน', 50],
        ],
        type : 'pie',
        onclick: function (d, i) { console.log("onclick", d, i); }
    }
});
c3.generate({
    bindto: '#chart1_4',
    data: {
        // iris data from R
        columns: [
            ['งบประมาณที่ตั้งไว้', 150],
            ['ผลการเบิกจ่ายงบประมาณจริง', 100],
            ['ยังไม่ได้รายงาน', 90],
        ],
        type : 'pie',
        onclick: function (d, i) { console.log("onclick", d, i); }
    }
});
c3.generate({
    bindto: '#chart1_5',
    data: {
        // iris data from R
        columns: [
            ['งบประมาณที่ตั้งไว้', 30],
            ['ผลการเบิกจ่ายงบประมาณจริง', 120],
            ['ยังไม่ได้รายงาน', 100],
        ],
        type : 'pie',
        onclick: function (d, i) { console.log("onclick", d, i); }
    }
});
c3.generate({
    bindto: '#chart2_1',
    data: {
        columns: [
            ['งบประมาณที่ตั้งไว้', 30, 200, 100, 400, 150, 150, 100, 150, 130, 300, 190, 40],
            ['ผลการเบิกจ่ายงบประมาณจริง', 50, 20, 10, 40, 15, 25, 70, 100, 190, 160, 150, 250],
            ['ยังไม่ได้รายงาน', 150, 100, 100, 98, 200, 25, 170, 130, 190, 260, 50, 150]
        ]
    }
});
c3.generate({
    bindto: '#chart2_2',
    data: {
        columns: [
            ['งบประมาณที่ตั้งไว้', 30, 200, 100, 400, 150, 150, 100, 150, 130, 300, 190, 40],
            ['ผลการเบิกจ่ายงบประมาณจริง', 50, 20, 10, 40, 15, 25, 70, 100, 190, 160, 150, 250],
            ['ยังไม่ได้รายงาน', 150, 100, 100, 98, 200, 25, 170, 130, 190, 260, 50, 150]
        ]
    }
});
c3.generate({
    bindto: '#chart2_3',
    data: {
        columns: [
            ['งบประมาณที่ตั้งไว้', 30, 200, 100, 400, 150, 150, 100, 150, 130, 300, 190, 40],
            ['ผลการเบิกจ่ายงบประมาณจริง', 50, 20, 10, 40, 15, 25, 70, 100, 190, 160, 150, 250],
            ['ยังไม่ได้รายงาน', 150, 100, 100, 98, 200, 25, 170, 130, 190, 260, 50, 150]
        ]
    }
});
c3.generate({
    bindto: '#chart2_4',
    data: {
        columns: [
            ['งบประมาณที่ตั้งไว้', 30, 200, 100, 400, 150, 150, 100, 150, 130, 300, 190, 40],
            ['ผลการเบิกจ่ายงบประมาณจริง', 50, 20, 10, 40, 15, 25, 70, 100, 190, 160, 150, 250],
            ['ยังไม่ได้รายงาน', 150, 100, 100, 98, 200, 25, 170, 130, 190, 260, 50, 150]
        ]
    }
});
c3.generate({
    bindto: '#chart2_5',
    data: {
        columns: [
            ['งบประมาณที่ตั้งไว้', 30, 200, 100, 400, 150, 150, 100, 150, 130, 300, 190, 40],
            ['ผลการเบิกจ่ายงบประมาณจริง', 50, 20, 10, 40, 15, 25, 70, 100, 190, 160, 150, 250],
            ['ยังไม่ได้รายงาน', 150, 100, 100, 98, 200, 25, 170, 130, 190, 260, 50, 150]
        ]
    }
});

